---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.SetInitialIntensity(Autodesk.Revit.DB.Lighting.InitialIntensity)
source: html/0efb807e-bc7f-50dc-886f-ab8e9958901a.htm
---
# Autodesk.Revit.DB.Lighting.LightType.SetInitialIntensity Method

Replace the current initial intensity object with the given object

## Syntax (C#)
```csharp
public void SetInitialIntensity(
	InitialIntensity initialIntensity
)
```

## Parameters
- **initialIntensity** (`Autodesk.Revit.DB.Lighting.InitialIntensity`) - An object derived from an InitialIntensity object

## Remarks
The argument object is cloned

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null